################################################################################
## 初始化
################################################################################

init offset = -2

################################################################################
## Game_Map 数据
################################################################################

define game_map_round_Newsdata = {}

define game_map_randomevent_None = ["randomEvent_1", "randomEvent_2", "randomEvent_3"]

define game_map_building_shortdescription = {   "police":"警察局是了解警务新闻的最好去处。犯罪新闻永远是给读者提供刺激的法宝，谁不想成为下一个名侦探呢！",
                                                "home":"甜蜜的家，在这里可以做很多事情，尽情地享受生活吧！",
                                                "news_shop":"报社所在处，在这里可以向同事们讨教工作上的难题，练习写作提高表达能力。",
                                                "fountain":"车水马龙的广场，总是聚集着不少人，时常会有人在此举行聚会。小偷因此很喜欢这里。",
                                                "shop":"三教九流都会光顾的商业街，能打听到不少八卦，了解新闻的时尚潮流。",
                                                "interview":"采访点，你可以获取线索，并有机会在这里采访到线索中的人物。",
                                                "rich":"上流住宅区，富人和名流们聚集之处。说不定哪一天就能结识些大人物，挖出一条劲爆独家新闻！"}

define palyer_currpos = [2,6]
define player_newsgrade = 0

default round_publishnews = {"":{}}
default round_deletenews = {}

default game_map_global_time = 0