init offset = -4


################################################################################
## Game_Map Templete
################################################################################

define Game_Map_MONTH_0or1_1982_templete = {"1": { "short_description":"",
                                                    "hot":0,
                                                    "explore_point":0,
                                                    "times":0,
                                                    "requirement":None,
                                                    "detail":"",
                                                    "opt1":"",
                                                    "opt1_result":{"艺术":0, "压力":0},
                                                    "opt2":"",
                                                    "opt2_result":{"":0}
                                                },
                                            "2": { "short_description":"",
                                                    "hot":0,
                                                    "explore_point":0,
                                                    "times":0,
                                                    "requirement":None,
                                                    "detail":"",
                                                    "opt1":"",
                                                    "opt1_result":{"艺术":0, "压力":0},
                                                    "opt2":"",
                                                    "opt2_result":{"":0}
                                                }
                                            }


################################################################################
## Game_Map 三月上棋盘
################################################################################

define Game_Map_march_0_1982 = {"1": { "short_description":"美术馆计划展出裸体塑像“女教皇”。",
                                        "hot":2,
                                        "explore_point":10,
                                        "times":5,
                                        "requirement":None,
                                        "detail": [ "波克先锋艺术展本月18日在巴特美术馆内举行，展出艺术家波克·里拉的画作，雕塑，以及其他艺术作品。",
                                                    "波克最著名的作品也将在展览中亮相，这件名为“女教皇”的裸体雕塑充分地展现了女性的肉体之美，也因此广受争议。",
                                                    "此次引进“女教皇”在国内引发反对声浪，如此大幅度裸露，是否是假“艺术”之名行低俗之实？",
                                                    "该作品以女教皇为名，是否有侮辱宗教之嫌？波克本人则表示，不能充分领略“女教皇”的美好是一种难以想象的损失。"],
                                        "opt1":"波克艺术展将在国家巴特美术馆举行",
                                        "opt1_result":{"艺术":1, "压力":2},
                                        "opt2":"尺度大到难以想象，“艺术”是“低俗”的挡箭牌吗？",
                                        "opt2_result":{"社会":1, "煽情":1, "压力":5}
                                    },
                                "2": { "short_description":"十年来零降雪的L市突然下起了大雪",
                                        "hot":0,
                                        "explore_point":0,
                                        "times":0,
                                        "requirement":None,
                                        "detail":[  "没有一个L市居民能够预料到能在四月，在以炎热著称的L市看到飞雪。昨日，十年来零降雪的L市突然降温，随后落下大雪，并持续了整整一天。",
                                                    "对于这样异常天气，几乎所有人都表达了自己的担忧，只有仍不懂事的孩子们在街头扬起雪花表达内心的喜悦。",
                                                    "有些人认定这是世界末日的前兆，一度沉寂已久的末日论又重新抬起头来，但气象专家称这仍在正常范围之内，不需要恐慌。"],
                                        "opt1":"异常降雪！“世界末日”前兆引恐慌",
                                        "opt1_result":{"煽情":1, "压力":5},
                                        "opt2":"L市异常降雪，出行需注意保暖",
                                        "opt2_result":{"客观":1, "压力":2}
                                    },
                                "3": { "short_description":"K市山火仍未扑灭，千人上山救火",
                                        "hot":0,
                                        "explore_point":0,
                                        "times":0,
                                        "requirement":None,
                                        "detail":[  "由于天气炎热，K市山火频发，目前参与灭火的人数已达1000，其中包括超过700名居民组成的志愿者。另有数千人由于山火被迫疏散。"],
                                        "opt1":"欧特朗山火肆虐，数千人志愿参与灭火",
                                        "opt1_result":{"社会":1, "压力":2},
                                        "opt2":"欧特朗山火继续扩大，市民不安自救",
                                        "opt2_result":{"社会":1, "自由主义":1, "压力":3}
                                    },
                                "4": { "short_description":"沃克街区发现一具男童的尸体，疑似被工头虐待致死",
                                        "hot":0,
                                        "explore_point":0,
                                        "times":0,
                                        "requirement":None,
                                        "detail":[  "死者身上有被殴打的痕迹，男孩母亲称工头曾多次虐打过死者，但被工头否认。其母认定是印刷厂的过失。目前，该男童的母亲仍留在印刷厂门口痛哭。"],
                                        "opt1":"新署长的第一案：鹿角巷惊现幼童尸体",
                                        "opt1_result":{"客观":1, "压力":2, "金钱":100, "Extra":"获得“《斩首杰克连环杀人案》”素材"},
                                        "opt2":"残忍切下死者头部，斩首凶手仍在逃",
                                        "opt2_result":{"煽情":1, "泽维尔认可":-1, "压力":3, "Extra":"获得“《斩首杰克连环杀人案》”素材"}
                                    },
                                "5": { "short_description":"",
                                        "hot":0,
                                        "explore_point":0,
                                        "times":0,
                                        "requirement":None,
                                        "detail":"",
                                        "opt1":"",
                                        "opt1_result":{"艺术":0, "压力":0},
                                        "opt2":"",
                                        "opt2_result":{"":0}
                                    },
                                "6": { "short_description":"",
                                        "hot":0,
                                        "explore_point":0,
                                        "times":0,
                                        "requirement":None,
                                        "detail":"",
                                        "opt1":"",
                                        "opt1_result":{"艺术":0, "压力":0},
                                        "opt2":"",
                                        "opt2_result":{"":0}
                                    },
                                "7": { "short_description":"",
                                        "hot":0,
                                        "explore_point":0,
                                        "times":0,
                                        "requirement":None,
                                        "detail":"",
                                        "opt1":"",
                                        "opt1_result":{"艺术":0, "压力":0},
                                        "opt2":"",
                                        "opt2_result":{"":0}
                                    }
                                }